import QtQuick 2.0
import QtQuick.Layouts 1.1

GridLayout
{
    id: root
    columns: 1
    DescriptionItem
    {
        source: "qrc:/images/Houses/greyjoy.png"
        description: "Дом Грейджой начинает игру с такими силами на поле:
2 корабля в заливе Эелезных людей
1 корабль в порту Пайка
1 рацарь и 1 пеший воин в Пайке
1 пеший войн в Сероводье"
        additionalDescription: "На треках Дом Грейджой занимает следующие позиции:
деление 5 на треке Железного трона
деление 1 на треке вотчин
деление 6 на треке королевского двора
деление 2 на треке снабжение
деление 1 на треке побед
"
    }
    DescriptionItem
    {
        source: "qrc:/images/stark.png"
        description: "Дом Старк начинает игру с такими силами на поле:
1 корабль в Дрожащем море
1 рыцарь и 1 пеший воин в Винтерфелле
1 пеший войн в Белой Гавани"
        additionalDescription: "На треках Дом Старк занимает следующие позиции:
деление 3 на треке Железного трона
деление 4 на треке вотчин
деление 2 на треке королевского двора
деление 1 на треке снабжение
деление 2 на треке побед
"
    }
    DescriptionItem
    {
        source: "qrc:/images/baratheon.png"
        description: "Дом Баратеон начинает игру с такими силами на поле:
2 корабля в Губительных Водах
1 рыцарь и 1 пеший воин на Драконьем Камне
1 пеший войн в Королевском Лесу"
        additionalDescription: "На треках Дом Баратеон занимает следующие позиции:
деление 1 на треке Железного трона
деление 5 на треке вотчин
деление 4 на треке королевского двора
деление 2 на треке снабжение
деление 1 на треке побед
"
    }
    DescriptionItem
    {
        source: "qrc:/images/Houses/martell.png"
        description: "Дом Мартелл начинает игру с такими силами на поле:
1 корабль в Дорнском Море
1 рыцарь и 1 пеший воин в Солнечном Копье
1 пеший войн на Солёном берегу"
        additionalDescription: "На треках Дом Мартелл занимает следующие позиции:
деление 4 на треке Железного трона
деление 3 на треке вотчин
деление 3 на треке королевского двора
деление 2 на треке снабжение
деление 1 на треке побед
"
    }
    DescriptionItem
    {
        source: "qrc:/images/Houses/tyrel.png"
        description: "Дом Тирелл начинает игру с такими силами на поле:
1 корабль в проливе Редвин
1 рыцарь и 1 пеший воин в Хайгардене
1 пеший войн на Дорнских марках"
        additionalDescription: "На треках Дом Тирелл занимает следующие позиции:
деление 6 на треке Железного трона
деление 2 на треке вотчин
деление 5 на треке королевского двора
деление 2 на треке снабжение
деление 1 на треке побед
"
    }
    DescriptionItem
    {
        source: "qrc:/images/Houses/lannister.png"
        description: "Дом Ланнистер начинает игру с такими силами на поле:
1 корабль в Золотом проливе
1 рыцарь и 1 пеший воин в Ланниспорте
1 пеший войн в Каменной Септе"
        additionalDescription: "На треках Дом Ланнистер занимает следующие позиции:
деление 2 на треке Железного трона
деление 6 на треке вотчин
деление 1 на треке королевского двора
деление 2 на треке снабжение
деление 1 на треке побед
"
    }
}
