import QtQuick 2.0

WesterosCardEffect
{
    id: root
    name: "Сбор войск"
    description: "Во всех подвластных вам замках и крепостях соберите войска, не превышая лимита снабжения. Замок имеет 1 очко сбора, крепость 2 очка сбора. Пеший воин стоит 1 очко сбора, рыцарь 2 очка сбора, корабль 1 очко сбора и осадная башная 2 очка сбора. Можно улучшить пешого война до рыцаря или осадной башни, потратив 1 очко сбора, однако нельзя поменять рыцаря на башню и наоборот. При сборе корабля, корабль выставляется в соседнее с провинцией море, не занятое другим игроком."
}
